balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F87J93.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR0_Prescale" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="uuuuuuuu" edc:name="TMR0_Prescale" edc:nmmrid="0x12" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalPS" edc:desc="" edc:mask="0xff" edc:name="InternalPS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="TMR1_Internal" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="TMR1_Internal" edc:nmmrid="0xC" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalTMR" edc:desc="" edc:mask="0xffff" edc:name="InternalTMR" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR1_Prescale" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="uuuuuuuu" edc:name="TMR1_Prescale" edc:nmmrid="0x13" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalPS" edc:desc="" edc:mask="0xff" edc:name="InternalPS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR2_Prescale" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="uuuuuuuu" edc:name="TMR2_Prescale" edc:nmmrid="0x14" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalPS" edc:desc="" edc:mask="0xff" edc:name="InternalPS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="TMR3_Internal" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="TMR3_Internal" edc:nmmrid="0xE" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalTMR" edc:desc="" edc:mask="0xffff" edc:name="InternalTMR" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR3_Prescale" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="uuuuuuuu" edc:name="TMR3_Prescale" edc:nmmrid="0x15" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalPS" edc:desc="" edc:mask="0xff" edc:name="InternalPS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:NMMRPlace>
      <edc:EmulatorZone edc:beginaddr="0xfa6" edc:endaddr="0xfc2" edc:regionid="emulatorzone"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly>
      <edc:GPRDataSector edc:beginaddr="0x0" edc:endaddr="0x60" edc:regionid="accessram"/>
    </edc:TraditionalModeOnly>
    <edc:ExtendedModeOnly>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x0" edc:endaddr="0x60" edc:regionid="gpre"/>
    </edc:ExtendedModeOnly>
  </edc:DataSpace>
  <edc:PinList>
    <edc:Pin>
      <!--Pin 1-->
      <edc:VirtualPin edc:name="RH2"/>
      <edc:VirtualPin edc:name="SEG45"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 2-->
      <edc:VirtualPin edc:name="RH3"/>
      <edc:VirtualPin edc:name="SEG44"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 3-->
      <edc:VirtualPin edc:name="RE1"/>
      <edc:VirtualPin edc:name="LCDBIAS2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 4-->
      <edc:VirtualPin edc:name="RE0"/>
      <edc:VirtualPin edc:name="LCDBIAS1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 5-->
      <edc:VirtualPin edc:name="RG0"/>
      <edc:VirtualPin edc:name="LCDBIAS0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 6-->
      <edc:VirtualPin edc:name="RG1"/>
      <edc:VirtualPin edc:name="TX2"/>
      <edc:VirtualPin edc:name="CK2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 7-->
      <edc:VirtualPin edc:name="RG2"/>
      <edc:VirtualPin edc:name="RX2"/>
      <edc:VirtualPin edc:name="DT2"/>
      <edc:VirtualPin edc:name="Vlcap1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 8-->
      <edc:VirtualPin edc:name="RG3"/>
      <edc:VirtualPin edc:name="Vlcap2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 9-->
      <edc:VirtualPin edc:name="MCLR"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 10-->
      <edc:VirtualPin edc:name="RG4"/>
      <edc:VirtualPin edc:name="SEG26"/>
      <edc:VirtualPin edc:name="RTCC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 11-->
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 12-->
      <edc:VirtualPin edc:name="Vddcore"/>
      <edc:VirtualPin edc:name="Vcap"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 13-->
      <edc:VirtualPin edc:name="RF7"/>
      <edc:VirtualPin edc:name="AN5"/>
      <edc:VirtualPin edc:name="SS"/>
      <edc:VirtualPin edc:name="SEG25"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 14-->
      <edc:VirtualPin edc:name="RF6"/>
      <edc:VirtualPin edc:name="AN11"/>
      <edc:VirtualPin edc:name="SEG24"/>
      <edc:VirtualPin edc:name="C1INA"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 15-->
      <edc:VirtualPin edc:name="RF5"/>
      <edc:VirtualPin edc:name="AN10"/>
      <edc:VirtualPin edc:name="CVref"/>
      <edc:VirtualPin edc:name="SEG23"/>
      <edc:VirtualPin edc:name="C1INB"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 16-->
      <edc:VirtualPin edc:name="RF4"/>
      <edc:VirtualPin edc:name="AN9"/>
      <edc:VirtualPin edc:name="SEG22"/>
      <edc:VirtualPin edc:name="C2INA"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 17-->
      <edc:VirtualPin edc:name="RF3"/>
      <edc:VirtualPin edc:name="AN8"/>
      <edc:VirtualPin edc:name="SEG21"/>
      <edc:VirtualPin edc:name="C2INB"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 18-->
      <edc:VirtualPin edc:name="RF2"/>
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="C1OUT"/>
      <edc:VirtualPin edc:name="SEG20"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 19-->
      <edc:VirtualPin edc:name="RH7"/>
      <edc:VirtualPin edc:name="SEG43"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 20-->
      <edc:VirtualPin edc:name="RH6"/>
      <edc:VirtualPin edc:name="SEG42"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 21-->
      <edc:VirtualPin edc:name="RH5"/>
      <edc:VirtualPin edc:name="SEG41"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 22-->
      <edc:VirtualPin edc:name="RH4"/>
      <edc:VirtualPin edc:name="SEG40"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 23-->
      <edc:VirtualPin edc:name="RF1"/>
      <edc:VirtualPin edc:name="AN6"/>
      <edc:VirtualPin edc:name="C2OUT"/>
      <edc:VirtualPin edc:name="SEG19"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 24-->
      <edc:VirtualPin edc:name="ENVREG"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 25-->
      <edc:VirtualPin edc:name="AVdd"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 26-->
      <edc:VirtualPin edc:name="AVss"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 27-->
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="Vref+"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 28-->
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="Vref-"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 29-->
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="SEG18"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 30-->
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="AN0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 31-->
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 32-->
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 33-->
      <edc:VirtualPin edc:name="RA5"/>
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="SEG15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 34-->
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="T0CKI"/>
      <edc:VirtualPin edc:name="SEG14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 35-->
      <edc:VirtualPin edc:name="RC1"/>
      <edc:VirtualPin edc:name="T1OSI"/>
      <edc:VirtualPin edc:name="CCP2"/>
      <edc:VirtualPin edc:name="SEG32"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 36-->
      <edc:VirtualPin edc:name="RC0"/>
      <edc:VirtualPin edc:name="T1OSO"/>
      <edc:VirtualPin edc:name="T13CKI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 37-->
      <edc:VirtualPin edc:name="RC6"/>
      <edc:VirtualPin edc:name="TX1"/>
      <edc:VirtualPin edc:name="CK1"/>
      <edc:VirtualPin edc:name="SEG27"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 38-->
      <edc:VirtualPin edc:name="RC7"/>
      <edc:VirtualPin edc:name="RX1"/>
      <edc:VirtualPin edc:name="DT1"/>
      <edc:VirtualPin edc:name="SEG28"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 39-->
      <edc:VirtualPin edc:name="RJ4"/>
      <edc:VirtualPin edc:name="SEG39"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 40-->
      <edc:VirtualPin edc:name="RJ5"/>
      <edc:VirtualPin edc:name="SEG38"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 41-->
      <edc:VirtualPin edc:name="RJ6"/>
      <edc:VirtualPin edc:name="SEG37"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 42-->
      <edc:VirtualPin edc:name="RJ7"/>
      <edc:VirtualPin edc:name="SEG36"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 43-->
      <edc:VirtualPin edc:name="RC2"/>
      <edc:VirtualPin edc:name="CCP1"/>
      <edc:VirtualPin edc:name="SEG13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 44-->
      <edc:VirtualPin edc:name="RC3"/>
      <edc:VirtualPin edc:name="SCK"/>
      <edc:VirtualPin edc:name="SCL"/>
      <edc:VirtualPin edc:name="SEG17"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 45-->
      <edc:VirtualPin edc:name="RC4"/>
      <edc:VirtualPin edc:name="SDI"/>
      <edc:VirtualPin edc:name="SDA"/>
      <edc:VirtualPin edc:name="SEG16"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 46-->
      <edc:VirtualPin edc:name="RC5"/>
      <edc:VirtualPin edc:name="SDO"/>
      <edc:VirtualPin edc:name="SEG12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 47-->
      <edc:VirtualPin edc:name="RB7"/>
      <edc:VirtualPin edc:name="KBI3"/>
      <edc:VirtualPin edc:name="PGD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 48-->
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 49-->
      <edc:VirtualPin edc:name="OSC1"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="RA7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 50-->
      <edc:VirtualPin edc:name="OSC2"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="RA6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 51-->
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 52-->
      <edc:VirtualPin edc:name="RB6"/>
      <edc:VirtualPin edc:name="KBI2"/>
      <edc:VirtualPin edc:name="PGC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 53-->
      <edc:VirtualPin edc:name="RB5"/>
      <edc:VirtualPin edc:name="KBI1"/>
      <edc:VirtualPin edc:name="SEG29"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 54-->
      <edc:VirtualPin edc:name="RB4"/>
      <edc:VirtualPin edc:name="KBI0"/>
      <edc:VirtualPin edc:name="SEG11"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 55-->
      <edc:VirtualPin edc:name="RB3"/>
      <edc:VirtualPin edc:name="INT3"/>
      <edc:VirtualPin edc:name="SEG10"/>
      <edc:VirtualPin edc:name="CTED2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 56-->
      <edc:VirtualPin edc:name="RB2"/>
      <edc:VirtualPin edc:name="INT2"/>
      <edc:VirtualPin edc:name="SEG9"/>
      <edc:VirtualPin edc:name="CTED1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 57-->
      <edc:VirtualPin edc:name="RB1"/>
      <edc:VirtualPin edc:name="INT1"/>
      <edc:VirtualPin edc:name="SEG8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 58-->
      <edc:VirtualPin edc:name="RB0"/>
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="SEG30"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 59-->
      <edc:VirtualPin edc:name="RJ3"/>
      <edc:VirtualPin edc:name="SEG35"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 60-->
      <edc:VirtualPin edc:name="RJ2"/>
      <edc:VirtualPin edc:name="SEG34"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 61-->
      <edc:VirtualPin edc:name="RJ1"/>
      <edc:VirtualPin edc:name="SEG33"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 62-->
      <edc:VirtualPin edc:name="RJ0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 63-->
      <edc:VirtualPin edc:name="RD7"/>
      <edc:VirtualPin edc:name="SEG7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 64-->
      <edc:VirtualPin edc:name="RD6"/>
      <edc:VirtualPin edc:name="SEG6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 65-->
      <edc:VirtualPin edc:name="RD5"/>
      <edc:VirtualPin edc:name="SEG5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 66-->
      <edc:VirtualPin edc:name="RD4"/>
      <edc:VirtualPin edc:name="SEG4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 67-->
      <edc:VirtualPin edc:name="RD3"/>
      <edc:VirtualPin edc:name="SEG3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 68-->
      <edc:VirtualPin edc:name="RD2"/>
      <edc:VirtualPin edc:name="SEG2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 69-->
      <edc:VirtualPin edc:name="RD1"/>
      <edc:VirtualPin edc:name="SEG1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 70-->
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 71-->
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 72-->
      <edc:VirtualPin edc:name="RD0"/>
      <edc:VirtualPin edc:name="SEG0"/>
      <edc:VirtualPin edc:name="CTPLS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 73-->
      <edc:VirtualPin edc:name="RE7"/>
      <edc:VirtualPin edc:name="CCP2"/>
      <edc:VirtualPin edc:name="SEG31"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 74-->
      <edc:VirtualPin edc:name="RE6"/>
      <edc:VirtualPin edc:name="COM3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 75-->
      <edc:VirtualPin edc:name="RE5"/>
      <edc:VirtualPin edc:name="COM2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 76-->
      <edc:VirtualPin edc:name="RE4"/>
      <edc:VirtualPin edc:name="COM1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 77-->
      <edc:VirtualPin edc:name="RE3"/>
      <edc:VirtualPin edc:name="COM0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 78-->
      <edc:VirtualPin edc:name="LCDBIAS3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 79-->
      <edc:VirtualPin edc:name="RH0"/>
      <edc:VirtualPin edc:name="SEG47"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 80-->
      <edc:VirtualPin edc:name="RH1"/>
      <edc:VirtualPin edc:name="SEG46"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>